#define SYSCLK_C_

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "Sysclk.h"


/**************************************************************************************************
 * @fn          Sysclk_Init
 * @brief       系统时钟频率设置为32Mhz
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Sysclk_Init(void)
{
  CLKCONCMD &= ~0x40;           //设置系统时钟为32Mhz外部晶振XOSC
  //while(!(SLEEPSTA & 0x40));  //等待32Mhz晶振上电稳定 
  while(CLKCONSTA & 0x40);
  CLKCONCMD &= ~0x47;           //设置系统当前时钟频率为32Mhz
  //SLEEPCMD  |=  0x04;         //关闭不用的RC振荡器
}