#define TIMER_C_

#include "Timer.h"

/* ------------------------------------------------------------------------------------------------
 *                                          Local Variable
 * ------------------------------------------------------------------------------------------------
 */
uint8_t   T1_100MS_Count;
uint8_t   T1_1S_Count;
uint8_t   T1_3S_Count;
uint8_t   T3_10MS_Count;



/* ------------------------------------------------------------------------------------------------
 *                                          T1/T3定时器设置
 * ------------------------------------------------------------------------------------------------
 */

/**************************************************************************************************
 * @fn          Timer1_Init
 * @brief       定时器1初始化，用作大延时
 * @param       无
 * @return      无
 **************************************************************************************************
 */

void Timer1_Init(void)
{
  T1CTL   = 0x0E;      //模计数模式，，从0记到TICCO，128分频
  T1CC0L  = 6250%256;   //6250*(128/16000000) = 50ms
  T1CC0H  = 6250/256;
  T1CCTL0|= 0x04;      //设置捕获比较通道0为比较模式，触发中断T
}


/**************************************************************************************************
 * @fn          Timer3_Init
 * @brief       定时器3初始化，用作小延时
 * @param       无
 * @return      无
 **************************************************************************************************
 */

void Timer3_Init(void)
{
  T3CTL   = 0x06;     //模计数模式，，从0记到TICCO,清除计数值
  
  T3CCTL0 = 0x00;     //初始化T3
  T3CC0   = 0x00;
  T3CCTL1 = 0x00;
  T3CC1   = 0x00;
  
  T3CTL  |= 0x08;     //T3溢出中断使能
  T3CTL  |= 0xE0;     //128分频
  T3CTL  &= ~0x03;    //自由运行模式，从0x00->0xff反复计数 1/（16000000/128）*256 = 0.5/244 S
  T3CTL  |= 0x10;     //启动T3定时器
}


/**************************************************************************************************
 * @fn          Timer_Int_Enable
 * @brief       定时器中断使能
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Timer_Int_Enable(void)
{
  T1IE    = 1;        //T1中断使能
  T3IE    = 1;        //T3中断使能
}

/**************************************************************************************************
 * @fn          Timer_Int_Enable
 * @brief       定时器中断禁止
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Timer_Int_Disable(void)
{
  T1IE    = 0;        //T1中断禁能
  T3IE    = 0;        //T3中断禁能
}



/* ------------------------------------------------------------------------------------------------
 *                                          延时设置
 * ------------------------------------------------------------------------------------------------
 */
/**************************************************************************************************
 * @fn          Delay_Init
 * @brief       中断变量初始化
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void Delay_Init(void)
{
  //T1
  T1_100MS_Count  = 0;
  T1_1S_Count     = 0;
  T1_3S_Count     = 0;
  
  T1_100MS_Flag   = TIMEEND;
  T1_1S_Flag      = TIMEEND;
  T1_3S_Flag      = TIMEINIT;           
  
  //T3
  T3_10MS_Count   = 0; 
  T3_10MS_Flag    = TIMEEND;            //计数标志
  
  //Timer_Int_Disable();                //定时器中断禁止
  //Timer_Int_Enable();
}



/**************************************************************************************************
 * @fn          Delay_Ms
 * @brief       延时
 * @param       n -> 延时时间 Ms
 * @return      无
 **************************************************************************************************
 */

void Delay_Ms(uint16_t n)
{
  uint16_t k1,k2;
  
  Timer_Int_Enable();                     //定时器中断使能
  
  if(n == 10)
  {
    T3_10MS_Flag = TIMESTART;             //开始计时
   
    for (k1=0;k1<100;k1++)              
    { 
       for (k2=0;k2<200;k2++)
       {
         ;;
       }
  
      if(T3_10MS_Flag == TIMEOUT)         //如果超时   
      {
        T3_10MS_Flag = TIMEEND;           //停止计时
        break;
      }  
    }
    
    T3_10MS_Flag  = TIMEEND;              //停止计时 
    T3_10MS_Count = 0; 
    
  }
  
  else if(n == 100)
  {
    T1_100MS_Flag = TIMESTART;            //开始计时
    
    for (k1=0;k1<600;k1++)              
    { 
       for (k2=0;k2<200;k2++)
       {
         ;;
       }
  
      if(T1_100MS_Flag == TIMEOUT)       //如果超时   
      {
        T1_100MS_Flag = TIMEEND;         //停止计时
        break;
      }  
    }
    
    T1_100MS_Flag = TIMEEND;              //停止计时  
    T1_100MS_Flag = TIMEEND;
    
  }
  
  else if(n == 1000)
  {
    T1_1S_Flag = TIMESTART;               //开始计时
    
    for (k1=0;k1<6000;k1++)                 
    { 
       for (k2=0;k2<200;k2++)
       {
         ;;
       }
  
      if(T1_1S_Flag == TIMEOUT)           //如果超时   
      {
        T1_1S_Flag = TIMEEND;             //停止计时
        break;
      }  
    }
    
    T1_1S_Flag  = TIMEEND;                //停止计时
    T1_1S_Count = 0;
  }
  
  Timer_Int_Disable();                    //定时器中断禁止
}



/* ------------------------------------------------------------------------------------------------
 *                                          定时中断
 * ------------------------------------------------------------------------------------------------
 */

/************************************************
 *function :  T1_ISR
 *describe :  定时器1中断，每隔50ms触发一次，需要注意的是同时只有一个延时在工作
 *input    :  无
 *return   :  无
 ***********************************************/
#pragma vector = T1_VECTOR
__interrupt void T1_ISR(void)
{
  
  /*1.开始计数*/
  if(T1_100MS_Flag == TIMESTART)
  {
    //Wdt_FeetDog();                 //中断里喂狗！可能需要注意
    T1_100MS_Count ++;
  }
  
  else if(T1_1S_Flag == TIMESTART)
  {
    //Wdt_FeetDog();                 //中断里喂狗！可能需要注意
    T1_1S_Count ++;
  }
  
  
  if(T1_3S_Flag == TIMESTART)      //这里不要用else if 因为3s是在while里的，如果有前面的延时触发，3s是会一直延长的
  {
    //Wdt_FeetDog();                 //中断里喂狗！可能需要注意 
    T1_3S_Count ++;
  }
 
  /*2.计数结束*/
  if(T1_100MS_Count == T1_100MS)
  {
    //Wdt_FeetDog();                 //中断里喂狗！可能需要注意
    T1_100MS_Flag = TIMEOUT;
    T1_100MS_Count = 0;
  }
  
  
  else if(T1_1S_Count == T1_1S)
  {
    T1_1S_Flag = TIMEOUT;
    T1_1S_Count = 0;
  }
  
  if(T1_3S_Count == T1_3S)
  {
    T1_3S_Flag = TIMEOUT;
    T1_3S_Count = 0;
  }
  
  
  /*3.计数清除*/
  if((T1_3S_Flag == TIMEEND) && (T1_3S_Count != 0))
  {
    T1_3S_Count = 0;
  }
  
  T1IF = 0;   //清除中断标志
}


/************************************************
 *function :  T3_ISR
 *describe :  定时器3中断，用于小延时
 *input    :  无
 *return   :  无
 ***********************************************/
#pragma vector = T3_VECTOR
__interrupt void T3_ISR(void)
{
  T3IF = 0;   //清除中断标志
  
  /*1.开始计数*/
  if(T3_10MS_Flag == TIMESTART)
  {
    T3_10MS_Count ++;
  }
  
  /*2.计数结束*/
  if(T3_10MS_Count == T3_10MS)    //定时10MS
  {
    T3_10MS_Flag  = TIMEOUT;
    T3_10MS_Count = 0;
  }  
  
}