#ifndef DATA_H_
#define DATA_H_


/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "AT24C256.h"
#include "Congfig.h"


/* ------------------------------------------------------------------------------------------------
 *                                          Define
 * ------------------------------------------------------------------------------------------------
 */

/******************状态标识*********************/
#define DATA_OK                   1     //操作成功
#define DATA_EXIST                2     //数据已经存在
#define DATA_FULL                 3     //存储容量已满
#define DATA_NULL                 4     //存储容量已空
#define DATA_ERR                  0     //操作失败



/* ------------------------------------------------------------------------------------------------
 *                                          Application
 * ------------------------------------------------------------------------------------------------
 */
uint8_t Data_Door_Init(void);
uint8_t Data_CommonCard_Init(void);
void Data_DoorID_Init(void);


void Data_DoorID_Read(uint8_t *DoorId);

uint8_t Data_CommonCard_Auth(uint8_t *CardId);
uint8_t Data_CommonCard_UnAuth(uint8_t *CardId);
uint8_t Data_CommonCard_Confirm(uint8_t *CardId);

/* ------------------------------------------------------------------------------------------------
 *                                          Prototypes
 * ------------------------------------------------------------------------------------------------
 */
uint8_t Data_Storage(uint8_t *WriteId, uint16_t WriteAddr);


#endif