#ifndef SLEEP_H_
#define SLEEP_H_

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include<ioCC2530.h>

/* ------------------------------------------------------------------------------------------------
 *                                          Define
 * ------------------------------------------------------------------------------------------------
 */
/*系统工作模式*/
#define SLEEP_PM0   0x00 //空闲模式 CPU停止工作
#define SLEEP_PM1   0x01 //PM1模式
#define SLEEP_PM2   0x02 //PM2模式,睡眠定时器可以工作
#define SLEEP_PM3   0x03 //PM3模式,只有外部I/O口中断和复位工作
#define SLEEP_OFF   0x04 //唤醒工作模式



/* ------------------------------------------------------------------------------------------------
 *                                          Prototypes
 * ------------------------------------------------------------------------------------------------
 */
void Sleep_INT_Init(void);
void Sleep_Init(void);
void Sleep_SetTime(uint8_t Sleep_Sec);
void Sleep_Set(void);
void Sleep_SetMode(uint8_t Sleep_Mode);
#endif