#define CC2530_C_

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "CC2530.h"



/**************************************************************************************************
 * @fn          CC2530_Init
 * @brief       CC2530端口初始化
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void CC2530_Init(void)
{
  Led_Init();                                                                   //P1.5端口门锁LED灯初始化
  Sleep_INT_Init();                                                             //P1.6端口睡眠中断设置初始化(中断暂时关闭)
  Motor_Init();                                                                 //P0.6、P0.7、P1.0、P1.1电机端口初始化
  Buzzer_Init();                                                                //P2.0端口蜂鸣器初始化
  Key_Init();                                                                   //P0.1门锁钥匙、P0.5反锁动作、P0.4关门检测端口初始化
  Adc_Init();                                                                   //P0.0电池电压检测端口设置为模拟输入功能
  I2C_Init();                                                                   //P1.2、P1.3 I2C端口设置
  Spi_IO_Init();                                                                //P1.2、P1.3、P1.7、P0.2、P0.3读卡器端口初始化                                        
  CC2530_NoUseIO_Init();                                                        //P1.4、P1.6、P2.1、P2.2 不用时要配置成上拉输入(包括P1.6口),详细见P71 未使用I/O口                              
}


/**************************************************************************************************
 * @fn          CC2530_NoUseIO_Init
 * @brief       CC2530未使用端口初始化
 * @param       无
 * @return      无
 **************************************************************************************************
 */

void CC2530_NoUseIO_Init(void)
{
  P1INP  &= ~0x50;                                                              //P1.4、P1.6、P2.1、P2.2 不用时要配置成上拉输入(包括P1.6口),详细见P71 未使用I/O口
  P2INP  &= ~0x06;
  P1DIR  &= ~0x50;
  P2DIR  &= ~0x06;
}


/**************************************************************************************************
 * @fn          CC2530_Sleep_Config
 * @brief       CC2530睡眠时端口设置
 * @param       Type ->  1 普通睡眠
                         2 最终睡眠
 * @return      无
 **************************************************************************************************
 */
void CC2530_Sleep_Config(uint8_t Type)
{
  /*未使用端口配置*/
  CC2530_NoUseIO_Init();
  
  /*蜂鸣器口*/
  P2DIR  |=  0x01;                                                              //蜂鸣器设置成输出
  P2INP  &= ~0x01;                                                              //P2_0口设置为上拉
  BUZZER  =  1;                                                                 //默认高电平
  
  /*机械开关门口*/
  P0INP &= ~0x32;                                                               //设置P0.5、P0.1、P0.4为上拉，接到电源正极
  P0DIR &= ~0x32;                                                               //设置P0.5、P0.1、P0.4为输入 
  //Key_Int_Enable();                                                             //P0.1中断使能
  //KeyDoor_Int_Disable();                                                      //P0.1禁止的情况下就不能唤醒了，证明了睡眠前端口的配置是保持的
  
  /*LED*/
  if(Type == GeneralSleep)
  {
    LED_OFF();                                                                  //P1.5灯灭
  }
 
  
  /*H桥电机*/
  Motor_H1H2OFF();                                                              //P0.6、P0.7、P1.1、P1.2电机H桥关闭
  
  /*I2C卡*/
  MFRC522_AntennaOff();	
  MFRC522_RST = 0;                                                              //低电平时切断内部电流吸收，关闭振荡器，断开输入管脚与外部电路的连接
  
  /*RF射频*/
  //Rf_Disable();                                                                 //防止钥匙唤醒时无故进入RF中断
  
  /*中断,钥匙开门能够唤醒*/
  CC2530_Int(KeyEnable);
  
  
}  

/**************************************************************************************************
 * @fn          CC2530_UnSleep_Config
 * @brief       CC2530解除睡眠时端口设置
 * @param       无
 * @return      无
 **************************************************************************************************
 */

void CC2530_UnSleep_Config(void)
{
  CC2530_Int(AllDisable);
  MFRC522_Reset();
}


/**************************************************************************************************
 * @fn          CC2530_Sleep
 * @brief       CC2530进入睡眠
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void CC2530_Sleep(void)
{
  CC2530_Sleep_Config(GeneralSleep);                                            //睡眠时端口设置
  Delay_Ms(10);
  Sleep_SetTime(1);                                                             //睡眠1S
  Sleep_SetMode(SLEEP_PM2);           
}



/**************************************************************************************************
 * @fn          CC2530_Int_Enable
 * @brief       CC2530中断控制函数
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void CC2530_Int(uint8_t EnableFlag)
{
  T1IE    = 0;        //T1中断禁能
  T3IE    = 0;        //T3中断禁能
  P0IEN  &= ~0x12;    //设置P0.1、P0.4中断禁止
  IEN2   &= ~(1<<0);  //清除RF全局中断  
  
  switch(EnableFlag)
  {
    case TimerEnable:   T1IE    = 1;        
                        T3IE    = 1;        
                        break;
                        
    case DoorEnable:    P0IEN |= 0x10;   
                        break;
                        
    case KeyEnable:     P0IEN |= 0x02;   
                        break;
                        
    case RfEnable:      IEN2  |= (1<<0);              
                        break;
                        
    default:            break;
  }
  
  
  
}