#define CC2530_C_

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "CC2530.h"


/**************************************************************************************************
 * @fn          CC2530_Int_Enable
 * @brief       CC2530中断控制函数
 * @param       无
 * @return      无
 **************************************************************************************************
 */
void CC2530_Int(uint8_t EnableFlag)
{
  T1IE    = 0;        //T1中断禁能
  T3IE    = 0;        //T3中断禁能
  IEN2   &= ~(1<<0);  //清除RF全局中断  
  IEN0   &= ~0x04;    //URX0IE = 0;
  
  switch(EnableFlag)
  {
    case TimerEnable:   T1IE    = 1;        
                        T3IE    = 1;        
                        break;
    
    case UartRxEnable:  IEN0   |= 0x04;
                        break;
                        
    case RfEnable:      IEN2  |= (1<<0);              
                        break;
                        
    default:            break;
  }
  
  
  
}